interface MajorDetail {
  color: string
  name: string
  value: string
}

interface StepDetail {
  text: string
  value: string
}

export const MAJOR = (major: string): string => {
  const majors = [
    {
      color: 'purple',
      name: 'คอนเทนท์',
      value: 'content'
    },
    {
      color: 'magenta',
      name: 'ดีไซน์',
      value: 'design'
    },
    {
      color: 'volcano',
      name: 'มาร์เก็ตติ้ง',
      value: 'marketing'
    },
    {
      color: 'geekblue',
      name: 'โปรแกรมมิ่ง',
      value: 'programming'
    }
  ]

  const result = majors.find((m: MajorDetail) => m.value === major) || {
    name: ''
  }

  return result.name
}

export const STEP = (step: string): string => {
  const steps = [
    {
      text: 'ข้อมูลส่วนตัว',
      value: 'info'
    },
    {
      text: 'ข้อมูลการติดต่อ',
      value: 'contact'
    },
    {
      text: 'คำถามกลาง',
      value: 'general'
    },
    {
      text: 'คำถามสาขา',
      value: 'major'
    },
    {
      text: 'สรุปข้อมูล',
      value: 'summary'
    }
  ]

  const result = steps.find((s: StepDetail) => s.value === step) || {
    text: ''
  }

  return result.text
}

export const GENERAL_QUESTION = [
  'ถ้าน้อง ๆ อยู่ในโลกที่มีโรคซอมบี้ระบาดขั้นเริ่มต้น แต่รัฐบาลบอกว่าจะจัดการซอมบี้ให้ได้ภายใน 4 สัปดาห์ ระหว่างนั้นน้อง ๆ จะวางแผนการใช้ชีวิตหรือมีวิธีการจัดการยังไงเพื่อให้ตัวเองและคนในสังคมอยู่รอดจนกว่าจะถึงเวลาที่รัฐบาลจัดการกับปัญหาได้เรียบร้อย',
  'ในโลกหลัง COVID - 19 ในแต่ละภาครัฐและเอกชนย่อมมีวิธีการปรับตัวในสถานการณ์ New Normal เพื่อมารับมือกับปัญหาที่เกิดขึ้น น้อง ๆ คิดว่ามี solution ไหนบ้าง ที่รู้สึกว่ายังสามารถพัฒนาได้ต่ออีก หรือน้อง ๆ สามารถคิดวิธีการใหม่ที่คิดว่าจะช่วยให้เกิดผลลัพธ์ที่ดีขึ้น พร้อมเหตุผล',
  'ให้น้อง ๆ เล่าประสบการณ์การทำงานที่รู้สึกว่าเป็นข้อผิดพลาด หรือมีอะไรที่ควรแก้ไขให้ดีขึ้นได้ และมีวิธีที่จะแก้ไขมันยังไง',
  'ค่าย YWC18 นี้สำคัญกับน้องยังไง ทำไมถึงสมัครเข้าร่วม และอะไรที่ทำให้เราต้องเลือกน้องมาอยู่ในค่าย'
]

export const MAJOR_QUESTION = (major: string) => {
  switch (major) {
    case 'content':
      return [
        `สมมติว่าน้องทำงานอยู่กรมประชาสัมพันธ์ ได้รับมอบหมายให้ทำคอนเทนต์ประชาสัมพันธ์ผลงานของรัฐบาลลงบนโซเชียลมีเดีย เพื่อให้เยาวชนคนรุ่นใหม่รู้สึกว่ารัฐบาลยังมีผลงานที่ดีอยู่ จะเป็นผลงานอะไรของกระทรวงไหนก็ได้ หลายผลงาน หลายกระทรวงก็ได้<br />
        ให้น้องสร้างสรรค์คอนเทนต์ประชาสัมพันธ์ตามโจทย์นี้ ลงบนพื้นที่โซเชียลมีเดียใดก็ได้ แล้วนำลิงก์ URL ของคอนเทนต์นั้นมาส่งเป็นคำตอบสำหรับโจทย์ข้อนี้<br />
        <u>หมายเหตุ</u>
        <li>ให้น้องใส่ข้อความ "เนื้อหาในโพสต์นี้ใช้เพื่อเป็นส่วนหนึ่งของการสมัครเข้าค่ายเท่านั้น ไม่มีส่วนเกี่ยวข้องกับรัฐบาลแต่อย่างใด" ไว้ที่ด้านบนของโพสต์ก่อนจะพิมพ์เนื้อหาคำตอบ</li>
        <li>น้อง ๆ สามารถเปิดเป็นเพจใหม่ แชนแนลใหม่ หรือสร้างแอคเคาต์หลุม ที่ไม่เชื่อมโยงกับแอคเคาต์ที่น้องใช้งานอยู่เป็นประจำได้ แต่อย่าลืมเซ็ตเป็น Public ให้กรรมการเข้าไปดูได้</li>`
      ]
    case 'design':
      return [
        `ให้จัดทำ Infographic เพื่อเล่าว่า ทำไมน้องถึงควรได้รับการคัดเลือกเป็น 1 ใน YWC รุ่น 18 สาขา Web Design โดยมีเงื่อนไข ดังนี้<br />
        <li>ออกแบบและจัดทำด้วยตนเอง ในแบบที่สร้างสรรค์ มีเอกลักษณ์</li>
        <li>ขนาด 1280 x 1920 pixel จำนวน 1 ชิ้นงาน</li>
        <li>ผลงานต้องไม่ออกมา มีลักษณะเป็น Resume/Profile สำเร็จรูป</li>
        <li>ส่งคำตอบเป็นไฟล์นามสกุล .png, .jpg, .jpeg, .bmp, .pdf ขนาดไม่เกิน 25 MB</li>`,
        `ให้ลองเสนอ 5 ไอเดียในฝัน ว่าภายในระยะ 10 ปีข้างหน้าจะมีเว็บหรือแอป Service อะไรได้ใหม่ จากผลของการเปลี่ยนแปลงพฤติกรรม, สถานการณ์, เทคโนโลยีในอนาคต<br />
        <u>ตัวอย่าง</u>
        <li>โรคระบาดต้องเว้นระยะห่างลดการเดินทาง + อินเตอร์ความเร็วสูงมีใช้กันทั่วถึง = การเกิดและเติบโตของแอป Online Conference</li>
        <li>โครงค่ายรถไฟฟ้ามากถึง 10 กว่าสายจะสร้างเสร็จ + เทคโนโลยีติดตาม/สแกนต่างๆ = แอปแนะนำเส้นทางการเดินทางอัตโนมัติ ตรวจสอบความหนาแน่น เวลาที่มาถึงของรถไฟ และส่งเสริมการค้ารอบสถานี</li>
        <li>เทคโนโลยีโดรนและอุปกรณ์ต่อขยาย ราคาถูกลงมาก + แนวคิดในการพัฒนาเกษตรกรรมไทย = โดรนที่ควบคุมผ่านแอป เพื่อติดตามและดูแลพืชไร่ พืชสวน ความชื้น อุณหภูมิ ศัตรูพืช ฯลฯ</li>`,
        `ให้ยกตัวอย่างเว็บหรือแอป Corporate/Brand พร้อมเขียนวิเคราะห์ข้อดี-ข้อด้อย ตามรายละเอียด ดังนี้<br />
        <li>capture ภาพหน้าจอมา 1-3 รูป + เขียนสรุปข้อดี 3 ข้อ และข้อด้อย 3 ข้อ</li>
        <li>วิเคราะห์ให้เป็นรูปธรรม ที่ลึกซึ้งเกี่ยวข้องกับที่มาของการออกแบบ/ผลกระทบ/แนวทางแก้ไข</li>
        <li>ควรเลือกเว็บหรือแอปที่ได้รับการออกแบบอย่างมีคุณภาพ ไม่ควรวิเคราะห์เพียงผิวเผิน เช่น ออกแบบสวยดี, ใช้งานง่าย</li>
        <u>หมายเหตุ</u>
        <li>ส่งคำตอบเป็นไฟล์นามสกุล .pdf ขนาดไม่เกิน 25 MB</li>`,
        `ส่ง Portfolio การออกแบบผลงานที่เคยทำมาใน 3 ขอบเขตนี้ ไม่จำกัดจำนวน<br />
        <li>เว็บหรือแอป Corporate/Brand</li>
        <li>เว็บหรือแอป Service</li>
        <li>Graphic Design</li>
        <u>หมายเหตุ</u>
        <li>ส่งคำตอบเป็นไฟล์นามสกุล .pdf ขนาดไม่เกิน 25 MB</li>
        <li>ไม่รับผลงาน 3D model, Architectural Design, Movie Editing, Coding</li>`
      ]
    case 'marketing':
      return [
        'น้องเคยเรียนวิชาทางการตลาดมาหรือไม่',
        'จงระบุ ชื่อวิชาทางการตลาด ต่างๆ ที่ได้ศึกษามาแล้วในความเข้าใจของท่าน หรือที่ท่านคิดว่ามีความเกี่ยวข้องกับศาสตร์ทางการตลาด ไม่ว่าจะเป็นวิชาหลัก หรือวิชาเสริม ในสถาบันการศึกษา',
        'จงอธิบายว่า จะทำอย่างไร ในการทำแผนการตลาดเว็บไซต์ ช่วยเหลือทีมในค่าย ให้เป็นผู้ชนะการแข่งขันได้',
        'จงอธิบายว่า จะทำอย่างไร ในการทำแผนการตลาดเว็บไซต์ ช่วยเหลือทีมในค่าย ให้เป็นผู้ชนะการแข่งขันได้ ทั้งที่ไม่ได้มีความรู้ทางการตลาดมาก่อน',
        'จงอธิบายว่า นักการตลาด คืออะไร มีหน้าที่อะไร และต่างหรือเหมือนกับ นักการตลาดดิจิทัล อย่างไร',
        'ตำแหน่งนักการตลาด ในทีมของ YWC มีหน้าที่ทำอะไร มีความสำคัญอย่างไรกับทีม ต้องทำอะไรบ้าง',
        'น้องคิดอย่างไร กับ "เว็บไซต์" ในยุคปัจจุบัน เว็บไซต์ยังมีความสำคัญอยู่ไหม อย่างไร ในยุคที่มีการเปลี่ยนแปลง พัฒนาทางเทคโนโลยี รวมทั้งการแพร่ระบาดของโควิด ที่เกิดขึ้น',
        `แนบผลงานพร้อมอธิบายท้ายผลงานว่าน้องเคยมีประสบการณ์การทำงานด้านการตลาดอะไรบ้าง ผลออกมาเป็นอย่างไร​ และอยากปรับปรุงตรงไหนอีก<br /><u>หมายเหตุ</u>
        <li>ไฟล์นามสกุล .pdf ขนาดไม่เกิน 25 MB</li>`
      ]
    case 'programming':
      return [
        'ให้น้องเล่าประสบการณ์การทำงานเกี่ยวกับการทำหรือพัฒนาเว็บไซต์ รวมถึงเหตุผลที่ชอบการพัฒนาเว็บไซต์ (สามารถแปะลิงค์ผลงานที่เคยทำไว้ได้)',
        'ให้น้องเลือก Technology, Library หรือแนวคิดใหม่ ๆ ในการทำเว็บมาหนึ่งอย่างพร้อมกับอธิบายว่าคืออะไร และทำไมถึงตัดสินใจเลือกอันนี้',
        'ให้ออกแบบระบบกรอกและส่งใบสมัครค่าย YWC#19 พร้อมระบบตรวจใบสมัครโดยคณะกรรมการ โดยให้ระบุ Feature ที่อยากให้มี, เทคโนโลยีที่จะเลือกใช้, โครงสร้างของฐานข้อมูล และ wireframe ของหน้าจอแบบคร่าว ๆ',
        'จาก Code HTML ด้านล่างนี้ มี Code CSS ใดที่เป็นไปได้บ้าง ในการจัดให้ div#center อยู่ตรงกลางภายใน div#wrapper (สามารถตอบได้มากกว่า 1 รูปแบบ)'
      ]
    default:
      return []
  }
}
